In [6]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%sql mysql+pymysql://root:Betty%40mysql123%21@localhost:3306/md_water_services

## Clustering data to unveil Maji ndogo's water crisis

#### Cleaning data

# Now, the employee table as we are going to see it has no data.We are going to update this for sending emails to them.The emails formats are first_name.last.last_name@ndogowater.gov

In [21]:
#Lets show all tables

In [22]:
%%sql
SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
8 rows affected.

[('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('location',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',)]

In [23]:
#The employee table

In [24]:
%%sql 
SELECT *
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 'Amara Jengo', '+99637993287 ', None, '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786 ', None, '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041 ', None, '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900 ', None, '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640 ', None, '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

In [25]:
#The email Column

In [26]:
%%sql
SELECT email
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(None,), (None,), (None,), (None,), (None,)]

We can determine the email address for each employee by:
- selecting the employee_name column
- replacing the space with a full stop
- make it lowercase
- and stitch it all together

In [27]:
#To remove the space space between the first and last names and replace it with a fullstop .We use the REPLACE command as below

In [28]:
%%sql
SELECT REPLACE(employee_name, " ", ".")
FROM employee
LIMIT 6;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
6 rows affected.

[('Amara.Jengo',),
 ('Bello.Azibo',),
 ('Bakari.Iniko',),
 ('Malachi.Mavuso',),
 ('Cheche.Buhle',),
 ('Zuriel.Matembo',)]

In [29]:
#Making it a lowercase

In [30]:
%%sql
SELECT LOWER(REPLACE(employee_name, " ", "."))
FROM employee
LIMIT 6 ;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
6 rows affected.

[('amara.jengo',),
 ('bello.azibo',),
 ('bakari.iniko',),
 ('malachi.mavuso',),
 ('cheche.buhle',),
 ('zuriel.matembo',)]

In [31]:
# Using CONCAT to stitch the other part of the email

In [32]:
%%sql
SELECT CONCAT(LOWER(REPLACE(employee_name, " ", ".")), '@ndogowater.gov') AS new_email
FROM employee
LIMIT 6 ;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
6 rows affected.

[('amara.jengo@ndogowater.gov',),
 ('bello.azibo@ndogowater.gov',),
 ('bakari.iniko@ndogowater.gov',),
 ('malachi.mavuso@ndogowater.gov',),
 ('cheche.buhle@ndogowater.gov',),
 ('zuriel.matembo@ndogowater.gov',)]

In [33]:
#Now to update the email column with the email addresses

In [38]:
%%sql
UPDATE employee
SET email = CONCAT(LOWER(REPLACE(employee_name, " ", ".")), '@ndogowater.gov') ;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

In [39]:
#Lets check the length of the phone numbers, it should be 12 but its giving us 13, because of the space at the end which should be removed

In [55]:
%%sql
SELECT LENGTH(phone_number)
FROM employee
LIMIT 7;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
7 rows affected.

[(13,), (13,), (13,), (13,), (13,), (13,), (13,)]

In [47]:
#We will use  TRIM() to write aa SELECT query again to remove space from a string and UPDATE the records just as before

In [56]:
%%sql
SELECT TRIM(phone_number) AS Trimmed_String
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('+99637993287',),
 ('+99643864786',),
 ('+99222599041',),
 ('+99945849900',),
 ('+99381679640',)]

In [58]:
%%sql
UPDATE employee
SET phone_number = TRIM(phone_number)

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

In [60]:
#To check the length of the phone number

In [61]:
%%sql
SELECT LENGTH(phone_number)
FROM employee
LIMIT 7;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
7 rows affected.

[(12,), (12,), (12,), (12,), (12,), (12,), (12,)]

#### Honouring workers

#To see how employees lived, using the employee table to count how many of our employees live in each town

In [64]:
#Lets first determine how many distinct towns there are

In [65]:
%%sql
SELECT DISTINCT town_name
FROM employee;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
9 rows affected.

[('Ilanga',),
 ('Rural',),
 ('Lusaka',),
 ('Zanzibar',),
 ('Dahabu',),
 ('Kintampo',),
 ('Harare',),
 ('Yaounde',),
 ('Serowe',)]

In [ ]:
#lets now perform a count based on number of employee_name(s) on each town

In [71]:
%%sql
SELECT town_name, COUNT(*) AS employee_name
FROM employee
GROUP BY town_name
#ORDER BY employee_name DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
9 rows affected.

[('Ilanga', 3),
 ('Rural', 29),
 ('Lusaka', 4),
 ('Zanzibar', 4),
 ('Dahabu', 6),
 ('Kintampo', 1),
 ('Harare', 5),
 ('Yaounde', 1),
 ('Serowe', 3)]

#We need to highlight  top 3 field surveyors, that is , those who collected the most records
#So let's use the database to get the employee_ids and use those to get the names, email and phone numbers of the three field surveyors with the most location visits.
#Let's first look at the number of records each employee collected. we first find the correct table, use the COUNT() function and then group, order and limit the results to only see the top 3 employee_ids with the highest number of locations visited.

In [9]:
%%sql
SELECT v.assigned_employee_id,e.employee_name,e.email, e.phone_number
FROM employee AS e
JOIN(SELECT assigned_employee_id FROM visits GROUP BY assigned_employee_id ORDER BY COUNT(*) DESC LIMIT 3) AS v
ON e.assigned_employee_id = v.assigned_employee_id;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(1, 'Bello Azibo', 'bello.azibo@ndogowater.gov', '+99643864786'),
 (30, 'Pili Zola', 'pili.zola@ndogowater.gov', '+99822478933'),
 (34, 'Rudo Imani', 'rudo.imani@ndogowater.gov', '+99046972648')]

In [4]:
%%sql
SELECT assigned_employee_id, COUNT(*) AS number_of_visits
FROM visits
GROUP BY assigned_employee_id
ORDER BY number_of_visits DESC
LIMIT 3

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(1, 3708), (30, 3676), (34, 3539)]

In [ ]:
# A more simpler approach: After determining the employees with the most records

In [90]:
%%sql
SELECT*
FROM employee
WHERE assigned_employee_id IN (1,30,34)

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(1, 'Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov', '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (30, 'Pili Zola', '+99822478933', 'pili.zola@ndogowater.gov', '46 Stone Town Street', 'Hawassa', 'Zanzibar', 'Field Surveyor'),
 (34, 'Rudo Imani', '+99046972648', 'rudo.imani@ndogowater.gov', '15 Lake Malawi Avenue', 'Kilimani', 'Ilanga', 'Field Surveyor')]

In [91]:
%%sql
SELECT employee_name, phone_number, email
FROM employee
WHERE assigned_employee_id IN (1,30,34)

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[('Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov'),
 ('Pili Zola', '+99822478933', 'pili.zola@ndogowater.gov'),
 ('Rudo Imani', '+99046972648', 'rudo.imani@ndogowater.gov')]

#### Analysing locations

Looking at the location table, let’s focus on the province_name, town_name and location_type to understand where the water sources are inMaji Ndogo.
Lets create a query that counts the number of records per town

In [104]:
%%sql
SELECT town_name, COUNT(*) AS records_per_town
FROM location
GROUP BY town_name
ORDER BY records_per_town DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Rural', 23740),
 ('Harare', 1650),
 ('Amina', 1090),
 ('Lusaka', 1070),
 ('Mrembo', 990)]

In [105]:
# Now to count records per province

In [111]:
%%sql
SELECT province_name, COUNT(*) AS records_per_province
FROM location
GROUP BY province_name
ORDER BY records_per_province DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Kilimani', 9510),
 ('Akatsi', 8940),
 ('Sokoto', 8220),
 ('Amanzi', 6950),
 ('Hawassa', 6030)]

From the above results, let's do the following:
1. Create a result set showing:
• province_name
• town_name
• An aggregated count of records for each town (consider naming this records_per_town).
• Ensure your data is grouped by both province_name and town_name.
2. Order your results primarily by province_name. Within each province, further sort the towns by their record counts in descending order

In [122]:
%%sql
SELECT province_name,town_name,
COUNT(*) AS records_per_town
FROM location
GROUP BY province_name, town_name
ORDER BY province_name,records_per_town DESC
LIMIT 6;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
6 rows affected.

[('Akatsi', 'Rural', 6290),
 ('Akatsi', 'Lusaka', 1070),
 ('Akatsi', 'Harare', 800),
 ('Akatsi', 'Kintampo', 780),
 ('Amanzi', 'Rural', 3100),
 ('Amanzi', 'Asmara', 930)]

In [ ]:
#Lets  look at the number of records for each location type

In [123]:
%%sql
SELECT COUNT(*) AS num_sources,location_type
FROM location
GROUP BY location_type
ORDER BY num_sources ASC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
2 rows affected.

[(15910, 'Urban'), (23740, 'Rural')]

In [ ]:
#Calculate the percentage of the Rural population in the wole records collected

In [124]:
%%sql
SELECT 23740 / (15910 + 23740) * 100

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('59.8739'),)]

In [ ]:
#To check the number of wells, taps and rivers ?

In [135]:
%%sql
SELECT type_of_water_source, COUNT(*)AS count_of_each_water_source
FROM water_source
GROUP BY type_of_water_source

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home', 7265),
 ('tap_in_home_broken', 5856),
 ('well', 17383),
 ('shared_tap', 5767),
 ('river', 3379)]

In [ ]:
 # How many people share particular types of water sources on average?

In [138]:
%%sql
SELECT type_of_water_source, AVG(number_of_people_served) AS AVEnumber_of_people_persource
FROM water_source
GROUP BY type_of_water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home', Decimal('644.0303')),
 ('tap_in_home_broken', Decimal('648.8593')),
 ('well', Decimal('278.5321')),
 ('shared_tap', Decimal('2071.3147')),
 ('river', Decimal('699.1844'))]

In [ ]:
#How many people are getting water from each type of source?

In [139]:
%%sql
SELECT type_of_water_source, SUM(number_of_people_served) AS sum_people_per_source
FROM water_source
GROUP BY type_of_water_source
ORDER BY sum_people_per_source DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272')),
 ('well', Decimal('4841724')),
 ('tap_in_home', Decimal('4678880')),
 ('tap_in_home_broken', Decimal('3799720')),
 ('river', Decimal('2362544'))]

In [ ]:
#Now let’s calculate the total number of people served by each type of water source in total, to make it easier to interpret, order them so the most people served by a source is at the top.

In [140]:
%%sql
SELECT SUM(number_of_people_served) AS total_population
FROM water_source

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('27628140'),)]

In [ ]:
# calculate the percentages per source using the total we just got.

In [154]:
%%sql
SELECT type_of_water_source, SUM(number_of_people_served) AS population_per_source,
(SUM(number_of_people_served) / (SELECT SUM(number_of_people_served) FROM water_source) * 100) AS percentage_per_source
FROM water_source
GROUP BY type_of_water_source
ORDER BY percentage_per_source DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272'), Decimal('43.2359')),
 ('well', Decimal('4841724'), Decimal('17.5246')),
 ('tap_in_home', Decimal('4678880'), Decimal('16.9352')),
 ('tap_in_home_broken', Decimal('3799720'), Decimal('13.7531')),
 ('river', Decimal('2362544'), Decimal('8.5512'))]

In [ ]:
#Let's round that off to 0 decimals, and order the results.

In [150]:
%%sql
SELECT type_of_water_source, SUM(number_of_people_served) AS population_per_source,
ROUND((SUM(number_of_people_served) / (SELECT SUM(number_of_people_served) FROM water_source)*100)) AS percentage_per_source
FROM water_source
GROUP BY type_of_water_source
ORDER BY percentage_per_source DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272'), Decimal('43')),
 ('well', Decimal('4841724'), Decimal('18')),
 ('tap_in_home', Decimal('4678880'), Decimal('17')),
 ('tap_in_home_broken', Decimal('3799720'), Decimal('14')),
 ('river', Decimal('2362544'), Decimal('9'))]

In [156]:
%%sql
SELECT DISTINCT type_of_water_source
FROM water_source

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home',),
 ('tap_in_home_broken',),
 ('well',),
 ('shared_tap',),
 ('river',)]

In [158]:
%%sql
SELECT type_of_water_source, SUM(number_of_people_served) AS population_served
FROM water_source
GROUP BY type_of_water_source
ORDER BY population_served DESC

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272')),
 ('well', Decimal('4841724')),
 ('tap_in_home', Decimal('4678880')),
 ('tap_in_home_broken', Decimal('3799720')),
 ('river', Decimal('2362544'))]

In [ ]:
#A rank based on the

In [159]:
%%sql
SELECT type_of_water_source,population_served,
RANK() OVER (ORDER BY population_served DESC) AS rank_by_population
FROM(SELECT type_of_water_source,SUM(number_of_people_served) AS population_served
FROM water_source
GROUP BY type_of_water_source) AS totalpeople
ORDER BY rank_by_population;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272'), 1),
 ('well', Decimal('4841724'), 2),
 ('tap_in_home', Decimal('4678880'), 3),
 ('tap_in_home_broken', Decimal('3799720'), 4),
 ('river', Decimal('2362544'), 5)]

Create a query to do this, and keep these requirements in mind:
1. The sources within each type should be assigned a rank.
2. Limit the results to only improvable sources.
3. Think about how to partition, filter and order the results set.
4. Order the results to see the top of the list

In [163]:
%%sql
SELECT source_id, type_of_water_source,population_served AS number_of_people_served,
DENSE_RANK() OVER (ORDER BY population_served DESC) AS priority_rank
FROM(SELECT source_id, type_of_water_source,SUM(number_of_people_served) AS population_served
FROM water_source
GROUP BY source_id, type_of_water_source) AS ranked_sources
ORDER BY priority_rank
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('HaRu19509224', 'shared_tap', Decimal('3998'), 1),
 ('AkRu05603224', 'shared_tap', Decimal('3998'), 1),
 ('AkRu04862224', 'shared_tap', Decimal('3996'), 2),
 ('AmAs10911224', 'shared_tap', Decimal('3996'), 2),
 ('KiHa22867224', 'shared_tap', Decimal('3996'), 2),
 ('KiZu31330224', 'shared_tap', Decimal('3994'), 3),
 ('HaRu19839224', 'shared_tap', Decimal('3994'), 3),
 ('KiRu28630224', 'shared_tap', Decimal('3992'), 4),
 ('KiZu31415224', 'shared_tap', Decimal('3992'), 4),
 ('AmPw12653224', 'shared_tap', Decimal('3990'), 5)]

In [ ]:
# How long did the survey take?

In [169]:
%%sql
SELECT*
FROM visits
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[(0, 'SoIl32582', 'SoIl32582224', datetime.datetime(2021, 1, 1, 9, 10), 1, 15, 12),
 (1, 'KiRu28935', 'KiRu28935224', datetime.datetime(2021, 1, 1, 9, 17), 1, 0, 46),
 (2, 'HaRu19752', 'HaRu19752224', datetime.datetime(2021, 1, 1, 9, 36), 1, 62, 40),
 (3, 'AkLu01628', 'AkLu01628224', datetime.datetime(2021, 1, 1, 9, 53), 1, 0, 1),
 (4, 'AkRu03357', 'AkRu03357224', datetime.datetime(2021, 1, 1, 10, 11), 1, 28, 14),
 (5, 'KiRu29315', 'KiRu29315224', datetime.datetime(2021, 1, 1, 10, 17), 1, 9, 40),
 (6, 'AkRu05234', 'AkRu05234224', datetime.datetime(2021, 1, 1, 10, 18), 1, 0, 30),
 (7, 'KiRu28520', 'KiRu28520224', datetime.datetime(2021, 1, 1, 10, 28), 1, 0, 34),
 (8, 'HaZa21742', 'HaZa21742224', datetime.datetime(2021, 1, 1, 10, 37), 1, 0, 6),
 (9, 'AmDa12214', 'AmDa12214224', datetime.datetime(2021, 1, 1, 10, 58), 1, 0, 36)]

In [170]:
%%sql
SELECT DATEDIFF(MAX(time_of_record),MIN(time_of_record))AS survey_duration_days
FROM visits;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(924,)]

In [171]:
%%sql
SELECT MIN(time_of_record)
FROM visits;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(datetime.datetime(2021, 1, 1, 9, 10),)]

In [177]:
%%sql
SELECT MAX(time_of_record)
FROM visits;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(datetime.datetime(2023, 7, 14, 13, 53),)]

In [ ]:
##What is the average total queue time for water?

In [189]:
%%sql
SELECT ROUND(AVG(NULLIF(time_in_queue, 0))) AS AVG_time_in_queue
FROM visits

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('123'),)]

In [ ]:
 #What is the average queue time on different days?

In [192]:
%%sql
SELECT 
      DAYNAME(time_of_record) AS day_of_the_week,
      ROUND(AVG(NULLIF(time_in_queue, 0))) AS AVG_queue_time
FROM visits
GROUP BY day_of_the_week
ORDER BY AVG_queue_time DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
7 rows affected.

[('Saturday', Decimal('246')),
 ('Monday', Decimal('137')),
 ('Friday', Decimal('120')),
 ('Tuesday', Decimal('108')),
 ('Thursday', Decimal('105')),
 ('Wednesday', Decimal('97')),
 ('Sunday', Decimal('82'))]

In [ ]:
#We can also look at what time during the day people collect water. Try to order the results in a meaningful way.

In [199]:
%%sql
SELECT 
      TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
      ROUND(AVG(NULLIF(time_in_queue, 0))) AS AVG_queue_time
FROM visits
GROUP BY hour_of_day
ORDER BY AVG_queue_time DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('19:00', Decimal('168')),
 ('17:00', Decimal('149')),
 ('07:00', Decimal('149')),
 ('06:00', Decimal('149')),
 ('08:00', Decimal('149'))]

In [ ]:
#Format the time well

In [198]:
%%sql
SELECT 
      DAYNAME(time_of_record) AS day_of_the_week,
      HOUR(time_of_record) AS hour_of_day,
      ROUND(AVG(NULLIF(time_in_queue, 0))) AS AVG_queue_time
FROM visits
GROUP BY hour_of_day, day_of_the_week
ORDER BY hour_of_day DESC

 * mysql+pymysql://root:***@localhost:3306/md_water_services
98 rows affected.

[('Friday', 19, Decimal('103')),
 ('Monday', 19, Decimal('159')),
 ('Saturday', 19, Decimal('282')),
 ('Sunday', 19, Decimal('127')),
 ('Thursday', 19, Decimal('137')),
 ('Tuesday', 19, Decimal('145')),
 ('Wednesday', 19, Decimal('176')),
 ('Friday', 18, Decimal('158')),
 ('Monday', 18, Decimal('174')),
 ('Saturday', 18, Decimal('240')),
 ('Sunday', 18, Decimal('80')),
 ('Thursday', 18, Decimal('132')),
 ('Tuesday', 18, Decimal('122')),
 ('Wednesday', 18, Decimal('113')),
 ('Friday', 17, Decimal('151')),
 ('Monday', 17, Decimal('181')),
 ('Saturday', 17, Decimal('251')),
 ('Sunday', 17, Decimal('79')),
 ('Thursday', 17, Decimal('129')),
 ('Tuesday', 17, Decimal('135')),
 ('Wednesday', 17, Decimal('121')),
 ('Friday', 16, Decimal('109')),
 ('Monday', 16, Decimal('127')),
 ('Saturday', 16, Decimal('251')),
 ('Sunday', 16, Decimal('83')),
 ('Thursday', 16, Decimal('99')),
 ('Tuesday', 16, Decimal('99')),
 ('Wednesday', 16, Decimal('90')),
 ('Friday', 15, Decimal('110')),
 ('Monday', 15, Decimal('126')),
 ('Saturday', 15, Decimal('248')),
 ('Sunday', 15, Decimal('83')),
 ('Thursday', 15, Decimal('92')),
 ('Tuesday', 15, Decimal('104')),
 ('Wednesday', 15, Decimal('88')),
 ('Friday', 14, Decimal('110')),
 ('Monday', 14, Decimal('127')),
 ('Saturday', 14, Decimal('244')),
 ('Sunday', 14, Decimal('83')),
 ('Thursday', 14, Decimal('96')),
 ('Tuesday', 14, Decimal('104')),
 ('Wednesday', 14, Decimal('92')),
 ('Friday', 13, Decimal('115')),
 ('Monday', 13, Decimal('122')),
 ('Saturday', 13, Decimal('242')),
 ('Sunday', 13, Decimal('81')),
 ('Thursday', 13, Decimal('101')),
 ('Tuesday', 13, Decimal('97')),
 ('Wednesday', 13, Decimal('98')),
 ('Friday', 12, Decimal('109')),
 ('Monday', 12, Decimal('115')),
 ('Saturday', 12, Decimal('239')),
 ('Sunday', 12, Decimal('78')),
 ('Thursday', 12, Decimal('96')),
 ('Tuesday', 12, Decimal('97')),
 ('Wednesday', 12, Decimal('88')),
 ('Friday', 11, Decimal('104')),
 ('Monday', 11, Decimal('115')),
 ('Saturday', 11, Decimal('236')),
 ('Sunday', 11, Decimal('78')),
 ('Thursday', 11, Decimal('99')),
 ('Tuesday', 11, Decimal('102')),
 ('Wednesday', 11, Decimal('86')),
 ('Friday', 10, Decimal('112')),
 ('Monday', 10, Decimal('119')),
 ('Saturday', 10, Decimal('259')),
 ('Sunday', 10, Decimal('83')),
 ('Thursday', 10, Decimal('95')),
 ('Tuesday', 10, Decimal('99')),
 ('Wednesday', 10, Decimal('89')),
 ('Friday', 9, Decimal('107')),
 ('Monday', 9, Decimal('127')),
 ('Saturday', 9, Decimal('252')),
 ('Sunday', 9, Decimal('84')),
 ('Thursday', 9, Decimal('99')),
 ('Tuesday', 9, Decimal('105')),
 ('Wednesday', 9, Decimal('94')),
 ('Friday', 8, Decimal('153')),
 ('Monday', 8, Decimal('183')),
 ('Saturday', 8, Decimal('247')),
 ('Sunday', 8, Decimal('86')),
 ('Thursday', 8, Decimal('129')),
 ('Tuesday', 8, Decimal('130')),
 ('Wednesday', 8, Decimal('119')),
 ('Friday', 7, Decimal('156')),
 ('Monday', 7, Decimal('186')),
 ('Saturday', 7, Decimal('247')),
 ('Sunday', 7, Decimal('82')),
 ('Thursday', 7, Decimal('139')),
 ('Tuesday', 7, Decimal('128')),
 ('Wednesday', 7, Decimal('111')),
 ('Friday', 6, Decimal('153')),
 ('Monday', 6, Decimal('190')),
 ('Saturday', 6, Decimal('247')),
 ('Sunday', 6, Decimal('79')),
 ('Thursday', 6, Decimal('134')),
 ('Tuesday', 6, Decimal('134')),
 ('Wednesday', 6, Decimal('112'))]

In [200]:
%%sql
SELECT 
      TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue ELSE NULL END),0) AS Sunday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue ELSE NULL END),0) AS Monday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue ELSE NULL END),0) AS Tuesday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue ELSE NULL END),0) AS Wednesday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue ELSE NULL END),0) AS Thursday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue ELSE NULL END),0) AS Friday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue ELSE NULL END),0) AS Saturday
FROM visits 
WHERE time_in_queue != 0
GROUP BY hour_of_day
ORDER BY hour_of_day;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
14 rows affected.

[('06:00', Decimal('79'), Decimal('190'), Decimal('134'), Decimal('112'), Decimal('134'), Decimal('153'), Decimal('247')),
 ('07:00', Decimal('82'), Decimal('186'), Decimal('128'), Decimal('111'), Decimal('139'), Decimal('156'), Decimal('247')),
 ('08:00', Decimal('86'), Decimal('183'), Decimal('130'), Decimal('119'), Decimal('129'), Decimal('153'), Decimal('247')),
 ('09:00', Decimal('84'), Decimal('127'), Decimal('105'), Decimal('94'), Decimal('99'), Decimal('107'), Decimal('252')),
 ('10:00', Decimal('83'), Decimal('119'), Decimal('99'), Decimal('89'), Decimal('95'), Decimal('112'), Decimal('259')),
 ('11:00', Decimal('78'), Decimal('115'), Decimal('102'), Decimal('86'), Decimal('99'), Decimal('104'), Decimal('236')),
 ('12:00', Decimal('78'), Decimal('115'), Decimal('97'), Decimal('88'), Decimal('96'), Decimal('109'), Decimal('239')),
 ('13:00', Decimal('81'), Decimal('122'), Decimal('97'), Decimal('98'), Decimal('101'), Decimal('115'), Decimal('242')),
 ('14:00', Decimal('83'), Decimal('127'), Decimal('104'), Decimal('92'), Decimal('96'), Decimal('110'), Decimal('244')),
 ('15:00', Decimal('83'), Decimal('126'), Decimal('104'), Decimal('88'), Decimal('92'), Decimal('110'), Decimal('248')),
 ('16:00', Decimal('83'), Decimal('127'), Decimal('99'), Decimal('90'), Decimal('99'), Decimal('109'), Decimal('251')),
 ('17:00', Decimal('79'), Decimal('181'), Decimal('135'), Decimal('121'), Decimal('129'), Decimal('151'), Decimal('251')),
 ('18:00', Decimal('80'), Decimal('174'), Decimal('122'), Decimal('113'), Decimal('132'), Decimal('158'), Decimal('240')),
 ('19:00', Decimal('127'), Decimal('159'), Decimal('145'), Decimal('176'), Decimal('137'), Decimal('103'), Decimal('282'))]

In [11]:
%%sql
SELECT 
      CASE 
          WHEN HOUR(time_of_record) BETWEEN 6  AND 11 THEN 'Morning' 
          WHEN HOUR(time_of_record) BETWEEN 12  AND 17 THEN 'Afternoon' 
          WHEN HOUR(time_of_record) BETWEEN 18  AND 23 THEN 'Evening' 
          ELSE 'Night'
      END AS time_period,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue ELSE NULL END),0) AS Sunday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue ELSE NULL END),0) AS Monday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue ELSE NULL END),0) AS Tuesday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue ELSE NULL END),0) AS Wednesday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue ELSE NULL END),0) AS Thursday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue ELSE NULL END),0) AS Friday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue ELSE NULL END),0) AS Saturday
FROM visits 
WHERE time_in_queue != 0
GROUP BY time_period
ORDER BY FIELD(time_period,'Morning', 'Afternoon', 'Evening', 'Night');

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[('Morning', Decimal('82'), Decimal('142'), Decimal('112'), Decimal('98'), Decimal('109'), Decimal('122'), Decimal('248')),
 ('Afternoon', Decimal('81'), Decimal('129'), Decimal('103'), Decimal('94'), Decimal('100'), Decimal('114'), Decimal('245')),
 ('Evening', Decimal('81'), Decimal('173'), Decimal('123'), Decimal('114'), Decimal('132'), Decimal('157'), Decimal('241'))]

#### CTE (common Table Expressions)

In [205]:
%%sql
WITH Timings AS (SELECT 
      CASE 
          WHEN HOUR(time_of_record) BETWEEN 6  AND 11 THEN 'Morning' 
          WHEN HOUR(time_of_record) BETWEEN 12  AND 17 THEN 'Afternoon' 
          WHEN HOUR(time_of_record) BETWEEN 18  AND 23 THEN 'Evening' 
          ELSE 'Night'
      END AS time_period,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue ELSE NULL END),0) AS Sunday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue ELSE NULL END),0) AS Monday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue ELSE NULL END),0) AS Tuesday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue ELSE NULL END),0) AS Wednesday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue ELSE NULL END),0) AS Thursday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue ELSE NULL END),0) AS Friday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue ELSE NULL END),0) AS Saturday
FROM visits 
WHERE time_in_queue != 0
GROUP BY time_period
ORDER BY FIELD(time_period,'Morning', 'Afternoon', 'Evening', 'Night'))


SELECT time_period, Sunday
FROM Timings

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[('Morning', Decimal('82')),
 ('Afternoon', Decimal('81')),
 ('Evening', Decimal('81'))]

In [ ]:
## Using VIEWS so that the created table is updated to a database i.e not temporary compared to WITH

In [207]:
%%sql
CREATE VIEW AS Created_view SELECT 
      CASE 
          WHEN HOUR(time_of_record) BETWEEN 6  AND 11 THEN 'Morning' 
          WHEN HOUR(time_of_record) BETWEEN 12  AND 17 THEN 'Afternoon' 
          WHEN HOUR(time_of_record) BETWEEN 18  AND 23 THEN 'Evening' 
          ELSE 'Night'
      END AS time_period,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue ELSE NULL END),0) AS Sunday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue ELSE NULL END),0) AS Monday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue ELSE NULL END),0) AS Tuesday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue ELSE NULL END),0) AS Wednesday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue ELSE NULL END),0) AS Thursday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue ELSE NULL END),0) AS Friday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue ELSE NULL END),0) AS Saturday
FROM visits 
WHERE time_in_queue != 0
GROUP BY time_period
ORDER BY FIELD(time_period,'Morning', 'Afternoon', 'Evening', 'Night')

 * mysql+pymysql://root:***@localhost:3306/md_water_services
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'AS Created_view SELECT \n      CASE \n          WHEN HOUR(time_of_record) BETWEEN ' at line 1")
[SQL: CREATE VIEW AS Created_view SELECT
      CASE
          WHEN HOUR(time_of_record) BETWEEN 6  AND 11 THEN 'Morning'
          WHEN HOUR(time_of_record) BETWEEN 12  AND 17 THEN 'Afternoon'
          WHEN HOUR(time_of_record) BETWEEN 18  AND 23 THEN 'Evening'
          ELSE 'Night'
      END AS time_period,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue ELSE NULL END),0) AS Sunday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue ELSE NULL END),0) AS Monday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue ELSE NULL END),0) AS Tuesday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue ELSE NULL END),0) AS Wednesday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue ELSE NULL END),0) AS Thursday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue ELSE NULL END),0) AS Friday,
      ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue ELSE NULL END),0) AS Saturday
FROM visits
WHERE time_in_queue != 0
GROUP BY time_period
ORDER BY FIELD(time_period,'Morning', 'Afternoon', 'Evening', 'Night')]
(Background on this error at: https://sqlalche.me/e/20/f405)